<?php

$lang['required']			= " %s Поле обязательно для заполнения.";
$lang['isset']				= " %s Поле должно иметь значение.";
$lang['valid_email']		= " %s Поле должно содержать корректный адрес электронной почты.";
$lang['valid_emails']		= " %s Поле должно содержать все действительные адреса .";
$lang['valid_url']			= " %s Поле должно содержать корректный URL.";
$lang['valid_ip']			= " %s Поле должно содержать корректный IP.";
$lang['min_length']			= " %s Поле должно быть по крайней мере %s символов.";
$lang['max_length']			= " %s Поле не может превышать %s символов.";
$lang['exact_length']		= " %s Поле должно быть точно %s символов.";
$lang['alpha']				= " %s Поле может содержать только буквенные символы.";
$lang['alpha_numeric']		= " %s Поле может содержать только алфавитно-цифровые символы.";
$lang['alpha_dash']			= " %s Поле может содержать только буквенно-цифровые символы, подчеркивания и тире.";
$lang['numeric']			= " %s Поле должно содержать только цифры.";
$lang['is_numeric']			= " %s Поле должно содержать только цифры.";
$lang['integer']			= " %s Поле должно содержать целое число.";
$lang['regex_match']		= " %s Поле не в правильном формате.";
$lang['matches']			= " %s Поле не соответствует %s.";
$lang['is_unique'] 			= " %s Поле должно содержать уникальное значение.";
$lang['is_natural']			= " %s Поле должно содержать только положительные числа.";
$lang['is_natural_no_zero']	= " %s Поле должно содержать число больше нуля.";
$lang['decimal']			= " %s Поле должно содержать десятичное число.";
$lang['less_than']			= " %s Поле должно содержать число меньше %s.";
$lang['greater_than']		= " %s Поле должно содержать число, большее %s.";


/* End of file form_validation_lang.php */
/* Location: ./system/language/russian/form_validation_lang.php */