<?php

$lang['ftp_no_connection']			= "Невозможно найти правильный идентификатор соединения. Пожалуйста, убедитесь, что вы подключены перед peforming любые процедуры файлов.";
$lang['ftp_unable_to_connect']		= "Не удается подключиться к FTP-серверу с помощью прилагаемого имя хоста.";
$lang['ftp_unable_to_login']		= "Невозможно войти в свой FTP-сервер. Пожалуйста, проверьте свои имя пользователя и пароль.";
$lang['ftp_unable_to_makdir']		= "Невозможно создать указанный каталог.";
$lang['ftp_unable_to_changedir']	= "Невозможно изменить каталоги.";
$lang['ftp_unable_to_chmod']		= "Невозможно установить права доступа к файлам. Пожалуйста, проверьте ваш путь. Примечание: Эта функция доступна только в PHP 5 или выше.";
$lang['ftp_unable_to_upload']		= "Невозможно загрузить указанный файл. Пожалуйста, проверьте ваш путь.";
$lang['ftp_unable_to_download']		= "Не удается загрузить указанный файл. Пожалуйста, проверьте ваш путь.";
$lang['ftp_no_source_file']			= "Невозможно найти исходный файл. Пожалуйста, проверьте ваш путь.";
$lang['ftp_unable_to_rename']		= "Невозможно переименовать файл.";
$lang['ftp_unable_to_delete']		= "Не удается удалить файл.";
$lang['ftp_unable_to_move']			= "Не удалось переместить файл. Пожалуйста, убедитесь, что каталог назначения существует.";


/* End of file ftp_lang.php */
/* Location: ./system/language/russian/ftp_lang.php */