<?php

$lang['imglib_source_image_required'] = "Вы должны указать исходный образ в ваших настройках.";
$lang['imglib_gd_required'] = "Библиотека изображений GD требуется для этой функции.";
$lang['imglib_gd_required_for_props'] = "Ваш сервер должен поддерживать библиотеку изображений GD для того, чтобы определить свойства изображения.";
$lang['imglib_unsupported_imagecreate'] = "Ваш сервер не поддерживает функцию GD, необходимое для обработки этого типа изображения.";
$lang['imglib_gif_not_supported'] = "GIF изображения часто не поддерживается из-за лицензионных ограничений. Вы, возможно, придется использовать JPG или PNG вместо изображения .";
$lang['imglib_jpg_not_supported'] = "JPG изображения не поддерживаются.";
$lang['imglib_png_not_supported'] = "PNG изображения не поддерживаются.";
$lang['imglib_jpg_or_png_required'] = "Протокол Image Resize указано в настройках работает только с типами изображений формата JPEG или PNG.";
$lang['imglib_copy_error'] = "Ошибка при попытке заменить файл. Пожалуйста, убедитесь, что ваш каталог файл для записи.";
$lang['imglib_rotate_unsupported'] = "Поворот изображения, кажется, не быть поддерживается сервером.";
$lang['imglib_libpath_invalid'] = "Путь к библиотеке изображения, не правильный. Пожалуйста,укажите верный путь в настройках изображений.";
$lang['imglib_image_process_failed'] = "Обработка изображений не удалась. Пожалуйста убедитесь что ваш сервер поддерживает выбранный протокол и что путь к вашей библиотеке изображений является правильным.";
$lang['imglib_rotation_angle_required'] = "Угол поворота требуется, чтобы повернуть изображение.";
$lang['imglib_writing_failed_gif'] = "GIF изображений.";
$lang['imglib_invalid_path'] = "Путь к образу не является правильным.";
$lang['imglib_copy_failed'] = "Процедура копирования изображений не удалось.";
$lang['imglib_missing_font'] = "Не удалось найти шрифт для.";
$lang['imglib_save_failed'] = "Невозможно сохранить изображение. Пожалуйста убедитесь, что изображение и каталог файлов доступны для записи.";


/* End of file imglib_lang.php */
/* Location: ./system/language/russian/imglib_lang.php */